<?php
namespace Home\Model;
use Think\Model;
class FocusModel extends Model{
    Static Public function unlimitedForLevel ($focus_data) {
		$focus_code=array('AA001001' =>'逾期1-30天',
			'AA001002' => '逾期31-60天',
			'AA001003' => '逾期61-90天',
			'AA001004' => '逾期91-120天',
			'AA001005' => '逾期121-150天',
			'AA001006' => '逾期151-180天',
			'AA001007' => '逾期180天以上',
			'AA001010' => '逾期1期',
			'AA001011' => '逾期2期',
			'AA001012' => '逾期3期',
			'AA001013' => '逾期4期',
			'AA001014' => '逾期5期',
			'AA001015' => '逾期6期',
			'AA001016' => '逾期6期以上',
			'AD001001' => '逾期1-7天',
			'AD001002' => '逾期8-14天',
			'AD001003' => '逾期15-30天',
			'AD001004' => '逾期31-60天',
			'AD001005' => '逾期61-90天',
			'AD001006' => '逾期91-120天',
			'AD001007' => '逾期121-150天',
			'AD001008' => '逾期151-180天',
			'AD001009' => '逾期180天以上',
			'AD002001' => '超期1-7天',
			'AD002002' => '超期8-14天',
			'AD002003' => '超期15-30天',
			'AD002004' => '超期31-60天',
			'AD002005' => '超期61-90天',
			'AD002006' => '超期91-120天',
			'AD002007' => '超期121-150天',
			'AD002008' => '超期151-180天',
			'AD002009' => '超期180天以上',
			'AD003001' => '超期1-7天',
			'AD003002' => '超期8-14天',
			'AD003003' => '超期15-30天',
			'AD003004' => '超期31-60天',
			'AD003005' => '超期61-90天',
			'AD003006' => '超期91-120天',
			'AD003007' => '超期121-150天',
			'AD003008' => '超期151-180天',
			'AD003009' => '超期180天以上',
			'AE001001' => '逾期1-7天',
			'AE001002' => '逾期8-14天',
			'AE001003' => '逾期15-30天',
			'AE001004' => '逾期31-60天',
			'AE001005' => '逾期61-90天',
			'AE001006' => '逾期91-120天',
			'AE001007' => '逾期121-150天',
			'AE001008' => '逾期150-180天',
			'AE001009' => '逾期180天以上',
			'AH001001' =>'欠费1-30天 因欠费被停机1-30天',
			'AH001002' =>'欠费31-60天 因欠费被停机31-60天',
			'AH001003' =>'欠费61-90天 因欠费被停机61-90天',
			'AH001004' =>'欠费91天以上 因欠费被停机91天及以上，一般被认定为恶意拆机',
			'AI003001' =>'逾期1-30天',
			'AI003002' =>'逾期31-60天',
			'AI003003' =>'逾期61-90天',
			'AI003004' =>'逾期91-120天',
			'AI003005' =>'逾期121-150天',
			'AI003006' =>'逾期151-180天',
			'AI003007' =>'逾期180天以上',
			'AG004001' =>'改变房屋用途',
			'AG004002' =>'拆改房屋结构',
			'AG004003' =>'屋内非法活动',
			'AG004004' =>'扰民被投诉',
			'AG004005' =>'擅自转租');
			$focus_money=array(
			'M01' => '(0,500]',
			'M02' => '(500,1000]',
			'M03' => '(1000,2000]',
			'M04' => '(2000,3000]',
			'M05' => '(3000,4000]',
			'M06' => '(4000,6000]',
			'M07' => '(6000,8000]',
			'M08' => '(8000,10000]',
			'M09' => '(10000,15000]',
			'M10' => '(15000,20000]',
			'M11' => '(20000,25000]',
			'M12' => '(25000,30000]',
			'M13' => '(30000,40000]',
			'M14' => '(40000,∞)');
			$focus_type=array(
			'AA001' => '借贷逾期',
			'AA002' => ' 套现',
			'AB001' => ' 被执行人',
			'AC001' => ' 盗卡者/盗卡者同伙',
			'AC002' => ' 欺诈者/欺诈同伙',
			'AC003' => '盗用操作/盗用者同伙',
			'AC004' => ' 盗用支出/盗用者同伙',
			'AC005' => '骗赔',
			'AC007' => ' 案件库黑名单',
			'AD001' => ' 逾期未支付',
			'AD002' => ' 超期未还车',
			'AD003' => ' 违章未处理',
			'AE001' => ' 逾期未支付',
			'AF001' => ' 虚假交易',
			'AF002' => ' 恶意差评',
			'AF003' => ' 涉嫌售假',
			'AF004' => ' 卖家套现',
			'AG001' => ' 租客房租逾期',
			'AG002' => ' 租客杂费逾期',
			'AG003' => ' 租客违约拒赔',
			'AG004' => ' 租客其它违约',
			'AG005' => ' 非正常解约',
			'AH001' => ' 违约欠费',
			'AI003' => ' 保证保险出险',
			);
        foreach ($focus_data as $key => $value) {
            foreach ($value as $key1 => $value1) {
                if($key1=='code'){
                    $focus_code_i=$focus_code[$value1];
                }
                if($key1=='type'){
                    $focus_type_i=$focus_type[$value1];
                }
                if($key1=='extend_info'){
                   foreach ($value1 as $key2 => $value2) {
                       if($value2['key']=='event_max_amt_code'){
                        $focus_zi_i=$value2['description'];
                        $focus_money_i=$focus_money[$value2['value']];
                       }
                   }
                }
                
            }
            $focus_type_character .=$focus_type_i.' '.$focus_code_i.' '.$focus_zi_i.' '.$focus_money_i;   
        }
	   return $focus_type_character;
	}
}